#! /usr/bin/python3
#-*-conding:utf-8-*-
# Copyright (c) 2017 - SUN Lei <leisun@genetics.ac.cn>

import random

#筮卜法（大衍筮法）
"""
大衍之数五十，其用四十有九。分而为二以象两，挂一以象三，
揲之以四以象四时，归奇于扐以象闰，五岁再闰，故再扐而后挂。
"""
def yin():
    print ("%s " %("\u268B"))
def yang():
    print ("%s " %("\u268A"))
def lao_yin():
    print ("%s%s" %("\u268B", "\u25CB"))
def lao_yang():
    print ("%s%s" %("\u268A", "\u25B3", ))
def bu():
    # 初始化
    num_great_flood = 50
    tai_chi = 1
    man = 1
    num = num_great_flood - tai_chi

    # 分而为二以象两，挂一以象三
    num_divided = random.randint(1, num)
    num_earth = max(num_divided, num - num_divided) - man
    num_sky = num - num_earth - man
    # 揲之以四以象四时，归奇于扐以象闰，
    mod_sky = num_sky % 4
    mod_earth = num_earth % 4
    if mod_sky == 0:
        temp_num_sky = num_sky - 4
    else:
        temp_num_sky = num_sky - mod_sky
    if mod_earth == 0:
        temp_num_earth = num_earth - 4
    else:
        temp_num_earth = num_earth - mod_earth
    num = temp_num_sky + temp_num_earth
    # 五岁再闰。
    for i in range(1, 3):

        # 揲之以四以象四时，归奇于扐以象闰，

        num_divided = random.randint(1, num)
        num_earth = max(num_divided, num - num_divided)
        num_sky = num - num_earth
        mod_sky = num_sky % 4
        mod_earth = num_earth % 4
        if num_sky == 0:
            temp_num_sky = num_sky
        elif mod_sky == 0:
            temp_num_sky = num_sky - 4
        else:
            temp_num_sky = num_sky - mod_sky

        if num_sky == 0:
            temp_num_earth = num_earth - 8
        elif mod_earth == 0:
            temp_num_earth = num_earth - 4
        else:
            temp_num_earth = num_earth - mod_earth
        num = temp_num_sky + temp_num_earth
# 再扐而后挂
    num_yao = num / 4
    return num_yao
yijing = {'111111':'1','111000':'11','111110':'43','111001':'26','111101':'14','111010':'5','111100':'34','111011':'9','000111':'12','000000':'2','000110':'45','000001':'23','000101':'35','000010':'8','000100':'16','000011':'20','110111':'10','110000':'19','110110':'58','110001':'41','110101':'38','110010':'60','110100':'54','110011':'61','001111':'33','001000':'15','001110':'31','001001':'52','001101':'56','001010':'39','001100':'62','001011':'53','101111':'13','101000':'36','101110':'49','101001':'22','101101':'30','101010':'63','101100':'55','101011':'37','010111':'6','010000':'7','010110':'47','010001':'4','010101':'64','010010':'29','010100':'40','010011':'59','100111':'25','100000':'24','100110':'17','100001':'27','100101':'21','100010':'3','100100':'51','100011':'42','011111':'44','011000':'46','011110':'28','011001':'18','011101':'50','011010':'48','011100':'32','011011':'57'}
def yi_1():
    print("乾卦\n乾为天    自强不息\n上上卦\n乾，元亨利貞。\n初九，潛龍勿用。\n九二，見龍在田，利見大人。\n九三，君子終日乾乾，夕惕若厲，旡咎。\n九四，或躍在淵，旡咎。\n九五，飛龍在天，利見大人。\n上九，亢龍有悔。\n用九，見群龍旡首，吉。")
def yi_2():
    print("坤卦\n坤为地    厚德载物\n上上卦\n坤，元亨，利牝馬之貞。君子有攸往，先迷，後得，主利，西南得朋，東北喪朋，安貞吉。\n初六，履霜，堅冰至。\n六二，直方大，不習无不利。\n六三，含章可貞，或從王事，无成有終。\n六四，括囊，无咎无譽。\n六五，黃裳，元吉。\n上六，龍戰于野，其血玄黃。\n用六，利永貞。")
def yi_3():
    print("屯卦\n水雷屯    起始维艰\n下下卦\n屯，元亨，利貞。勿用有攸往，利建侯。\n初九，磐桓，利居貞，利建侯。\n六二，屯如邅如，乘馬班如，匪寇婚媾，女子貞不字，十年乃字。\n六三，即鹿无虞，惟入于林中。君子幾，不如舍。往吝。\n六四，乘馬班如，求婚媾，往吉无不利。\n九五，屯其膏，小貞吉，大貞凶。\n上六，乘馬班如，泣血漣如。")
def yi_4():
    print("蒙卦\n山水蒙    启蒙奋发\n中下卦\n蒙，亨。匪我求童蒙，童蒙求我。初筮告，再三瀆，瀆則不告。利貞。\n蒙，亨，以亨行，時中也。\n匪我求童蒙，童蒙求我，志應也。\n初筮告，以剛中也。\n再三瀆，瀆則不告，瀆蒙也。蒙以養正，聖功也。\n初六，發蒙。利用刑人，用說桎梏，以往吝。\n九二，包蒙，吉。納婦吉，子克家。\n六三，勿用取女，見金夫，不有躬，无攸利。\n六四，困蒙，吝。\n六五，童蒙，吉。\n上九，擊蒙，不利為寇，利禦寇。")
def yi_5():
    print("需卦\n水天需    守正待机\n中上卦\n需，有孚，光亨，貞吉，利涉大川。\n利涉大川，往有功也。\n初九，需于郊，利用恆，无咎。\n利用恆，无咎，未失常也。\n九二，需于沙，小有言，終吉。\n九三，需于泥，致寇至。\n六四，需于血，出自穴。\n九五，需于酒食，貞吉。\n上六，入于穴，有不速之客三人來，敬之，終吉。")
def yi_6():
    print("訟卦\n天水讼    慎争戒讼\n中下卦\n訟，有孚，窒惕，中吉，終凶。利見大人，不利涉大川。\n訟，訟有孚，窒惕，中吉，剛來而得中也。\n終凶，訟不可成也。\n利見大人，尚中正也。\n不利涉大川，入于淵也。\n初六，不永所事，小有言，終吉。\n九二，不克訟，歸而逋，其邑人三百戶，无眚。\n六三，食舊德，貞厲，終吉，或從王事，无成。\n九四，不克訟，復即命，渝安貞，吉。\n九五，訟，元吉。\n上九，或錫之鞶帶，終朝三褫之。")
def yi_7():
    print("師卦\n地水师    行险而顺\n中上卦\n師，貞丈人，吉，无咎。\n初六，師出以律，否臧，凶。\n九二，在師中，吉，无咎，王三錫命。\n六三，師或輿尸，凶。\n六四，師左次，无咎。\n六五，田有禽，利執言，无咎。長子帥師，弟子輿尸，貞凶。\n上六，大君有命，開國承家，小人勿用。")
def yi_8():
    print("比卦\n水地比    诚信团结\n上上卦\n比，吉。原筮，元永貞，无咎。不寧方來，後夫凶。\n原筮，元永貞，无咎，以剛中也。\n不寧方來，上下應也。\n後夫凶，其道窮也。\n初六，有孚，比之无咎。有孚盈缶，終來，有它吉。\n六二，比之自內，貞吉。\n六三，比之匪人。\n六四，外比之，貞吉。\n九五，顯比，王用三驅，失前禽，邑人不誡，吉。\n上六，比之无首，凶。")
def yi_9():
    print("小畜卦\n风天小畜    蓄养待进\n下下卦\n小畜，亨。密雲不雨，自我西郊。\n密雲不雨，尚往也；自我西郊，施未行也。\n初九，復自道，何其咎，吉。\n九二，牽復，吉。\n九三，輿說輻，夫妻反目。\n六四，有孚，血去惕出，无咎。\n九五，有孚攣如，富以其鄰。\n上九，既雨既處，尚德載，婦貞厲。月幾望，君子征凶。")
def yi_10():
    print("履卦\n天泽履    脚踏实地\n中上卦\n履虎尾，不咥人，亨。\n初九，素履，往，无咎。\n九二，履道坦坦，幽人貞吉。\n六三，眇能視，跛能履，履虎尾，咥人，凶。武人為于大君。\n九四，履虎尾，愬愬，終吉。\n九五，夬履，貞厲。\n上九，視履，考祥其旋，元吉。")
def yi_11():
    print("泰卦\n地天泰    应时而变\n中中卦\n泰，小往大來，吉亨。\n初九，拔茅茹，以其彙，征吉。\n九二，包荒，用馮河，不遐遺，朋亡，得尚于中行。\n九三，无平不陂，无往不復。艱貞，无咎。勿恤其孚，于食有福。\n六四，翩翩不富，以其鄰，不戒以孚。\n六五，帝乙歸妹，以祉，元吉。\n上六，城復于隍，勿用師。自邑告命，貞吝。")
def yi_12():
    print("否卦\n天地否(pǐ)    不交不通\n中中卦\n否之匪人，不利君子貞，大往小來。\n初六，拔茅茹，以其彙，貞吉，亨。\n六二，包承，小人吉，大人否亨。\n六三，包羞。\n九四，有命无咎，疇離祉。\n九五，休否，大人吉，其亡其亡，繫于苞桑。\n上九，傾否，先否後喜。")
def yi_13():
    print("同人卦\n天火同人    上下和同\n中上卦\n同人于野，亨。利涉大川，利君子貞。\n君子以類族辨物。\n初九，同人于門，无咎。\n六二，同人于宗，吝。\n九三，伏戎于莽，升其高陵，三歲不興。\n九四，乘其墉，弗克攻，吉。\n九五，同人，先號咷而後笑，大師克，相遇。\n上九，同人于郊，无悔。")
def yi_14():
    print("大有卦\n火天大有    顺天依时\n上上卦\n初九，无交害，匪咎，艱則无咎。\n九二，大車以載，有攸往，无咎。\n九三，公用亨于天子，小人弗克。\n九四，匪其彭，无咎。\n六五，厥孚交如，威如，吉。\n上九，自天祐之，吉，无不利。")
def yi_15():
    print("謙卦\n地山谦    内高外低\n中中卦\n謙，亨，君子有終。\n初六，謙謙君子，用涉大川，吉。\n六二，鳴謙，貞吉。\n九三，勞謙，君子有終，吉。\n六四，无不利，撝謙。\n六五，不富以其鄰，利用侵伐，无不利。\n上六，鳴謙，利用行師，征邑國。")
def yi_16():
    print("豫卦\n雷地豫    顺时依势\n中中卦\n豫，利建侯，行師。\n初六，鳴豫，凶。\n六二，介于石，不終日，貞吉。\n六三，盱豫，悔，遲有悔。\n九四，由豫，大有得。勿疑，朋盍簪。\n六五，貞疾，恒不死。\n上六，冥豫成，有渝，无咎。")
def yi_17():
    print("隨卦\n泽雷随    随时变通\n中中卦\n隨，元亨，利貞，无咎。\n初九，官有渝，貞吉。出門交，有功。\n六二，係小子，失丈夫。\n六三，係丈夫，失小子。隨有求得，利居貞。\n九四，隨有獲，貞凶。有孚在道，以明，何咎？\n九五，孚于嘉，吉。\n上六，拘係之乃從維之，王用亨于西山。")
def yi_18():
    print("蠱卦\n山风蛊    振疲起衰\n中中卦\n蠱，元亨，利涉大川。先甲三日，後甲三日。\n蠱元亨，而天下治也；利涉大川，往有事也；先甲三日，後甲三日，終則有始，天行也。\n初六，幹父之蠱。有子，考无咎，厲，終吉。\n九二，幹母之蠱，不可貞。\n九三，幹父之蠱，小有悔，无大咎。\n六四，裕父之蠱，往見吝。\n六五，幹父之蠱，用譽。\n上九，不事王侯，高尚其事。")
def yi_19():
    print("臨卦\n地泽临    教民保民\n中上卦\n臨，元亨，利貞，至于八月有凶。\n初九，咸臨，貞吉。\n九二，咸臨，吉，无不利。\n六三，甘臨，无攸利，既憂之，无咎。\n六四，至臨，无咎。\n六五，知臨，大君之宜，吉。\n上六，敦臨，吉，无咎。")
def yi_20():
    print("觀卦\n风地观    观下瞻上\n中上卦\n觀，盥而不薦，有孚顒若。\n初六，童觀，小人无咎，君子吝。\n六二，闚觀，利女貞。\n六三，觀我生，進退。\n六四，觀國之光，利用賓于王。\n九五，觀我生，君子无咎。\n上九，觀其生，君子无咎。")
def yi_21():
    print("噬嗑卦\n火雷噬嗑    刚柔相济\n上上卦\n噬嗑，亨，利用獄。\n初九，屨校滅趾，无咎。\n六二，噬膚，滅鼻，无咎。\n六三，噬腊肉，遇毒。小吝，无咎。\n九四，噬乾胏，得金矢，利艱貞吉。\n六五，噬乾肉，得黃金，貞厲，无咎。\n上九，何校滅耳，凶。")
def yi_22():
    print("賁卦\n山火贲    饰外扬质\n中上卦\n賁，亨，小利有攸往。\n初九，賁其趾，舍車而徒。\n六二，賁其須。\n九三，賁如濡如，永貞吉。\n六四，賁如皤如，白馬翰如，匪寇婚媾。\n六五，賁于丘園，束帛戔戔。吝，終吉。\n上九，白賁，无咎。")
def yi_23():
    print("剝卦\n山地剥    顺势而止\n中下卦\n剝，不利有攸往。\n初六，剝床以足，蔑貞，凶。\n六二，剝床以辨，蔑貞，凶。\n六三，剝之无咎。\n六四，剝床以膚，凶。\n六五，貫魚，以宮人寵，无不利。\n上九，碩果不食，君子得輿，小人剝廬。")
def yi_24():
    print("復卦\n地雷复    寓动于顺\n中中卦\n復，亨。出入无疾，朋來无咎。反復其道，七日來復，利有攸往。\n初九，不遠復，无祇悔，元吉。\n六二，休復，吉。\n六三，頻復，厲，无咎。\n六四，中行獨復。\n六五，敦復，无悔。\n上六，迷復，凶，有災眚，用行師，終有大敗。以其國君，凶。至于十年不克征。")
def yi_25():
    print("无妄卦\n天雷无妄    无妄而得\n下下卦\n无妄，元亨，利貞。其匪正，有眚，不利有攸往。\n初九，无妄往，吉。\n六二，不耕穫，不菑畬，則利有攸往。\n六三，无妄之災，或繫之牛，行人之得，邑人之災。\n九四，可貞，无咎。\n九五，无妄之疾，勿藥，有喜。\n上九，无妄行，有眚，无攸利。")
def yi_26():
    print("大畜卦\n山天大畜    止而不止\n中上卦\n大畜，利貞，不家食，吉，利涉大川。\n初九，有厲，利已。\n九二，輿說輹。\n九三，良馬逐，利艱貞。曰閑輿衛，利有攸往。\n六四，童牛之牿，元吉。\n六五，豶豕之牙，吉。\n上九，何天之衢亨。")
def yi_27():
    print("頤卦\n山雷颐    纯正以养\n上上卦\n頤，貞吉，觀頤，自求口實。\n初九，舍爾靈龜，觀我朵頤，凶。\n六二，顛頤，拂經于丘，頤，征凶。\n六三，拂頤，貞凶。十年勿用，无攸利。\n六四，顛頤，吉，虎視眈眈，其欲逐逐，无咎。\n六五，拂經，居貞吉，不可涉大川。\n上九，由頤，厲，吉，利涉大川。")
def yi_28():
    print("大過卦\n泽风大过    非常行动\n中下卦\n大過，棟撓。利有攸往，亨。\n初六，藉用白茅，无咎。\n九二，枯楊生稊，老夫得其女妻，无不利。\n九三，棟橈，凶。\n九四，棟隆，吉，有它吝。\n九五，枯楊生華，老婦得其士夫，无咎无譽。\n上六，過涉滅頂，凶，无咎。")
def yi_29():
    print("習坎卦\n坎为水    行险用险\n下下卦\n習坎，有孚，維心亨，行有尚。\n初六，習坎，入于坎窞，凶。\n九二，坎，有險，求小得。\n六三，來之坎坎，險且枕，入于坎窞，勿用。\n六四，樽酒，簋貳，用缶，納約自牖，終无咎。\n九五，坎不盈，祗既平，无咎。\n上六，係用黴纆，寘于叢棘，三歲不得，凶。")
def yi_30():
    print("離卦\n离为火    附和依托\n中上卦\n離，利貞，亨，畜牝牛，吉。\n初九，履錯然，敬之，无咎。\n六二，黃離，元吉。\n九三，日昃之離，不鼓缶而歌，則大耋之嗟，凶。\n九四，突如其來如，焚如，死如，棄如。\n六五，出涕沱若，戚嗟若，吉。\n上九，王用出征，有嘉折首，獲匪其醜，无咎。")
def yi_31():
    print("咸卦\n泽山咸    相互感应\n中上卦\n咸，亨，利貞，取女吉。\n初六，咸其拇。\n六二，咸其腓，凶，居吉。\n九三，咸其股，執其隨，往吝。\n九四，貞吉，悔亡，憧憧往來，朋從爾思。\n九五，咸其脢，无悔。\n上六，咸其輔頰舌。")
def yi_32():
    print("恒卦\n雷风恒    恒心有成\n中上卦\n恒，亨，无咎，利貞，利有攸往。\n初六，浚恒，貞凶，无攸利。\n九二，悔亡。\n九三，不恒其德，或承之羞，貞吝。\n九四，田无禽。\n六五，恒其德貞，婦人吉，夫子凶。\n上六，振恒，凶。")
def yi_33():
    print("遯卦\n天山遁    遁世救世\n下下卦\n遯，亨，小利貞。\n初六，遯尾，厲。勿用有攸往。\n六二，執之用黃牛之革，莫之勝說。\n九三，係遯，有疾厲，畜臣妾吉。\n九四，好遯，君子吉，小人否。\n九五，嘉遯，貞吉。\n上九，肥遯无不利。")
def yi_34():
    print("大壯\n雷天大壮    壮勿妄动\n中上卦\n大壯，利貞。\n初九，壯于趾，征凶，有孚。\n九二，貞吉。\n九三，小人用壯，君子用罔。貞厲，羝羊觸藩，羸其角。\n九四，貞吉，悔亡，藩決不羸，壯于大輿之輹。\n六五，喪羊于易，无悔。\n上六，羝羊觸藩，不能退，不能遂，无攸利，艱則吉。")
def yi_35():
    print("晉卦\n火地晋    求进发展\n中上卦\n晉，康侯用錫馬蕃庶，晝日三接。\n初六，晉如摧如，貞吉。罔孚裕，无咎。\n六二，晉如愁如，貞吉。受茲介福，于其王母。\n六三，眾允，悔亡。\n九四，晉如鼫鼠，貞厲。\n六五，悔亡，失得勿恤。往，吉，无不利。\n上九，晉其角，維用伐邑。厲，吉，无咎，貞吝。")
def yi_36():
    print("明夷卦\n地火明夷    晦而转明\n中下卦\n明夷，利艱貞。\n初九，明夷于飛，垂其翼，君子于行，三日不食。有攸往，主人有言。\n六二，明夷，夷于左股，用拯馬壯吉。\n九三，明夷于南狩，得其大首，不可疾貞。\n六四，入于左腹，獲明夷之心，于出門庭。\n六五，箕子之明夷，利貞。\n上六，不明晦，初登于天，後入于地。")
def yi_37():
    print("家人卦\n风火家人    诚威治业\n下下卦\n家人，利女貞。\n初九，閑有家，悔亡。\n六二，无攸遂，在中饋，貞吉。\n九三，家人嗃嗃，悔厲吉，婦子嘻嘻，終吝。\n六四，富家，大吉。\n九五，王假有家，勿恤，吉。\n上九，有孚，威如，終吉。")
def yi_38():
    print("睽卦\n火泽睽    异中求同\n下下卦\n睽，小事吉。\n初九，悔亡，喪馬，勿逐，自復。見惡人，无咎。\n九二，遇主于巷，无咎。\n六三，見輿曳，其牛掣，其人天且劓，无初有終。\n九四，睽孤，遇元夫。交孚，厲无咎。\n六五，悔亡。厥宗噬膚，往何咎。\n上九，睽孤，見豕負塗，載鬼一車，先張之弧，後說之弧，匪寇婚媾。往，遇雨則吉。")
def yi_39():
    print("蹇卦\n水山蹇    险阻在前\n下下卦\n蹇，利西南，不利東北，利見大人，貞吉。\n初六，往蹇，來譽。\n六二，王臣蹇蹇，匪躬之故。\n九三，往蹇，來反。\n六四，往蹇，來連。\n九五，大蹇，朋來。\n上六，往蹇，來碩，吉，利見大人。")
def yi_40():
    print("解卦\n雷水解    柔道致治\n中上卦\n解，利西南，无所往，其來復。吉，有攸往，夙吉。\n初六，无咎。\n九二，田獲三狐，得黃矢，貞吉。\n六三，負且乘，致寇至，貞吝。\n九四，解而拇，朋至斯孚。\n六五，君子維有解，吉，有孚于小人。\n上六，公用射隼于高墉之上，獲之，无不利。")
def yi_41():
    print("損卦\n山泽损    损益制衡\n下下卦\n損，有孚，元吉，无咎，可貞，利有攸往。曷之用，二簋可用享。\n初九，已事遄往，无咎，酌損之。\n九二，利貞，征凶。弗損，益之。\n六三，三人行，則損一人，一人行，則得其友。\n六四，損其疾，使遄有喜，无咎。\n六五，或益之，十朋之龜，弗克違，元吉。\n上九，弗損，益之，无咎，貞吉，利有攸往，得臣无家。")
def yi_42():
    print("益卦\n风雷益    损上益下\n上上卦\n益，利有攸往，利涉大川。\n初九，利用為大作，元吉，无咎。\n六二，或益之，十朋之龜，弗克違，永貞吉。王用享于帝，吉。\n六三，益之，用凶事，无咎。有孚，中行告公，用圭。\n六四，中行，告公從，利用為依遷國。\n九五，有孚，惠心，勿問元吉。有孚，惠我德。\n上九，莫益之，或擊之，立心勿恆，凶。")
def yi_43():
    print("夬卦\n泽天夬      决而能和\n上上卦\n夬，揚于王庭，孚號有厲。告自邑，不利即戎，利有攸往。\n初九，壯于前趾，往不勝，為咎。\n九二，惕號，莫夜有戎，勿恤。\n九三，壯于頄，有凶。君子夬夬，獨行，遇雨若濡。有慍，无咎。\n九四，臀无膚，其行次且，牽羊悔亡，聞言不信。\n九五，莧陸夬夬，中行无咎。\n上六，无號，終有凶。")
def yi_44():
    print("姤卦\n天风姤     天下有风\n上卦\n姤，女壯，勿用取女。\n初六，繫于金柅，貞吉。有攸往，見凶。羸豕孚蹢躅。\n九二，包有魚，无咎，不利賓。\n九三，臀无膚，其行次且，厲，无大咎。\n九四，包无魚，起凶。\n九五，以杞包瓜，含章，有隕自天。\n上九，姤其角，吝，无咎。")
def yi_45():
    print("萃卦\n泽地萃    荟萃聚集\n中上卦\n萃，亨。王假有廟，利見大人，亨，利貞。用大牲，吉。利有攸往。\n初六，有孚不終，乃亂乃萃，若號。一握為笑，勿恤，往，无咎。\n六二，引吉，无咎，孚乃利用禴。\n六三，萃如嗟如，无攸利。往无咎，小吝。\n九四，大吉，无咎。\n九五，萃有位，无咎，匪孚。元永貞，悔亡。\n上六，齎咨涕洟，无咎。")
def yi_46():
    print("升卦\n地风升    柔顺谦虚\n上上卦\n升，元亨。用見大人，勿恤。南征吉。\n初六，允升，大吉。\n九二，孚乃利用禴，无咎。\n九三，升虛邑。\n六四，王用亨于岐山，吉，无咎。\n六五，貞吉，升階。\n上六，冥升，利于不息之貞。")
def yi_47():
    print("困卦\n泽水困    困境求通\n中上卦\n困，亨。貞大人吉，无咎。有言不信。\n初六，臀困于株木，入于幽谷，三歲不覿。\n九二，困于酒食，朱紱方來，利用享祀，征凶，无咎。\n六三，困于石，據于蒺蔾，入于其宮，不見其妻，凶。\n九四，來徐徐，困于金車。吝，有終。\n九五，劓刖，困于赤紱，乃徐有說。利用祭祀。\n上六，困于葛藟，于臲卼，曰動悔有悔，征吉。")
def yi_48():
    print("井卦\n水风井    求贤若渴\n上上卦\n井，改邑不改井，无喪无得，往來井井。汔至亦未繘井，羸其瓶，凶。\n初六，井泥不食，舊井无禽。\n九二，井谷射鮒，甕敝漏。\n九三，井渫不食，為我心惻，可用汲。王明，並受其福。\n六四，井甃无咎。\n九五，井洌，寒泉，食。\n上六，井收，勿幕，有孚，元吉。")
def yi_49():
    print("革卦\n泽火革    顺天应人\n上上卦\n革，已日乃孚，元亨，利貞，悔亡。\n初九，鞏用黃牛之革。\n六二，已日乃革之，征吉，无咎。\n九三，征凶，貞厲，革言三就，有孚。\n九四，悔亡，有孚改命，吉。\n九五，大人虎變，未占有孚。\n上六，君子豹變，小人革面，征凶，居貞吉。")
def yi_50():
    print("鼎卦\n火风鼎    稳重图变\n中下卦\n鼎，元吉，亨。\n初六，鼎顛趾，利出否，得妾以其子，无咎。\n九二，鼎有實，我仇有疾，不我能即，吉。\n九三，鼎耳革，其行塞，雉膏不食。方雨虧悔，終吉。\n九四，鼎折足，覆公餗，其形渥，凶。\n六五，鼎黃耳金鉉，利貞。\n上九，鼎玉鉉，大吉，无不利。")
def yi_51():
    print("震卦\n震为雷    临危不乱\n中上卦\n震，亨。震來虩虩，笑言啞啞，震驚百里，不喪七鬯。\n初九，震來虩虩，後笑言啞啞，吉。\n六二，震來厲，億喪貝，躋于九陵。勿逐，七日得。\n六三，震蘇蘇，震行无眚。\n九四，震遂泥。\n六五，震往來厲，億无喪，有事。\n上六，震索索，視矍矍，征凶。震不于其躬，于其鄰，无咎。婚媾有言。")
def yi_52():
    print("艮卦\n艮为山    动静适时\n中下卦\n艮其背，不獲其身；行其庭，不見其人。无咎。\n初六，艮其趾，无咎，利永貞。\n六二，艮其腓，不拯其隨，其心不快。\n九三，艮其限，列其夤，厲薰心。\n六四，艮其身，无咎。\n六五，艮其輔，言有序，悔亡。\n上九，敦艮，吉。")
def yi_53():
    print("漸卦\n风山渐    渐进蓄德\n上上卦\n漸，女歸吉，利貞。\n初六，鴻漸于干，小子厲，有言，无咎。\n六二，鴻漸于磐，飲食衎衎，吉。\n九三，鴻漸于陸，夫征不復，婦孕不育，凶，利禦寇。\n六四，鴻漸于木，或得其桷，无咎。\n九五，鴻漸于陵，婦三歲不孕，終莫之勝，吉。\n上九，鴻漸于陸，其羽可用為儀，吉。")
def yi_54():
    print("歸妹卦\n雷泽归妹    立家兴业\n下下卦\n歸妹，征凶，无攸利。\n初九，歸妹以娣，跛能履，征吉。\n九二，眇能視，利幽人之貞。\n六三，歸妹以須，反歸以娣。\n九四，歸妹愆期，遲歸有時。\n六五，帝乙歸妹，其君之袂，不如其娣之袂良。月幾望，吉。\n上六，女承筐无實，士刲羊无血，无攸利。")
def yi_55():
    print("豐卦\n雷火丰    日中则斜\n上上卦\n豐，亨，王假之。勿憂，宜日中。\n初九，遇其配主，雖旬，无咎，往有尚。\n六二，豐其蔀，日中見斗。往得疑疾，有孚發若，吉。\n九三，豐其沛，日中見沬。折其右肱，无咎。\n九四，豐其蔀，日中見斗，遇其夷主，吉。\n六五，來章，有慶譽，吉。\n上六，豐其屋，蔀其家，闚其戶，闃其无人，三歲不覿，凶。")
def yi_56():
    print("旅卦\n火山旅    依义顺时\n下下卦\n旅，小亨，旅貞吉。\n初六，旅瑣瑣，斯其所取災。\n六二，旅即次，懷其資，得童僕貞。\n九三，旅焚其次，喪其童僕，貞，厲。\n九四，旅于處，得其資斧，我心不快。\n六五，射雉一矢，亡，終以譽命。\n上九，鳥焚其巢，旅人先笑後號咷，喪牛于易，凶。")
def yi_57():
    print("巽卦\n巽为风    谦逊受益\n中上卦\n巽，小亨，利有攸往，利見大人。\n初六，進退，利武人之貞。\n九二，巽在床下，用史巫，紛若，吉，无咎。\n九三，頻巽，吝。\n六四，悔亡，田獲三品。\n九五，貞吉，悔亡，无不利。无初有終，先庚三日，後庚三日，吉。\n上九，巽在床下，喪其資斧，貞凶。")
def yi_58():
    print("兌卦\n兑为泽    刚内柔外\n上上卦\n兌，亨，利貞。\n初九，和兌吉。\n九二，孚兌，吉，悔亡。\n六三，來兌，凶。\n九四，商兌未寧，介疾有喜。\n九五，孚于剝，有厲。\n上六，引兌。")
def yi_59():
    print("渙卦\n风水涣    拯救涣散\n下下卦\n渙，亨。王假有廟，利涉大川，利貞。\n初六，用拯馬壯，吉。\n九二，渙奔其机，悔亡。\n六三，渙其躬，无悔。\n六四，渙其群，元吉，渙有丘，匪夷所思。\n九五，渙汗其大號，渙王居，无咎。\n上九，渙其血，去逖出，无咎。")
def yi_60():
    print("節卦\n水泽节    万物有节\n上上卦\n節，亨。苦節，不可貞。\n初九，不出戶庭，无咎。\n九二，不出門庭，凶。\n六三，不節若，則嗟若，无咎。\n六四，安節，亨。\n九五，甘節，吉，往有尚。\n上六，苦節，貞凶，悔亡。")
def yi_61():
    print("中孚卦\n风泽中孚    诚信立身\n下下卦\n中孚，豚魚吉，利涉大川，利貞。\n初九，虞吉，有它不燕。\n九二，鶴鳴在陰，其子和之；我有好爵，吾與爾靡之。\n六三，得敵，或鼓或罷，或泣或歌。\n六四，月幾望，馬匹亡，无咎。\n九五，有孚攣如，无咎。\n上九，翰音登于天，貞凶。")
def yi_62():
    print("小過卦\n雷山小过    行动有度\n中上卦\n小過，亨，利貞。可小事，不可大事。飛鳥遺之音，不宜上，宜下。大吉。\n初六，飛鳥以凶。\n六二，過其祖，遇其妣，不及其君，遇其臣，无咎。\n九三，弗過防之，從或戕之，凶。\n九四，无咎，弗過遇之，往厲必戒，勿用永貞。\n六五，密雲不雨，自我西郊，公弋取彼在穴。\n上六，弗遇過之，飛鳥離之，凶，是謂災眚。")
def yi_63():
    print("既濟卦\n水火既济    盛极将衰\n中上卦\n既濟，亨小，利貞。\n初吉，終亂。\n初吉，柔得中也，終止則亂，其道窮也。\n初九，曳其輪，濡其尾，无咎。\n六二，婦喪其茀，勿逐，七日得。\n九三，高宗伐鬼方，三年克之，小人勿用。\n六四，繻有衣袽，終日戒。\n九五，東鄰殺牛，不如西鄰之禴祭，實受其福。\n上六，濡其首，厲。")
def yi_64():
    print("未濟卦\n火水未济    事业未竟\n中下卦\n未濟，亨。小狐汔濟，濡其尾，无攸利。\n初六，濡其尾，吝。\n九二，曳其輪，貞吉。\n六三，未濟，征凶，利涉大川。\n九四，貞吉，悔亡，震用伐鬼方，三年有賞于大國。\n六五，貞吉无悔，君子之光，有孚，吉。\n上九，有孚于飲酒，无咎。濡其首，有孚，失是。")

gua = []
xiang = []
xiang_bian = []

for i in range(0, 6):
    gua.append(bu())

for j in reversed(gua):
    if j == 8:
        yin()
        xiang.append("0")
    elif j == 7:
        yang()
        xiang.append("1")
    elif j == 6:
        lao_yin()
        xiang.append("0")
    else:
        lao_yang()
        xiang.append("1")
str = ""
xiang = str.join(reversed(xiang))
order = yijing[xiang]
func = "yi_" + order + "()"
eval(func)
print("\n變卦:")
for k in reversed(gua):
    if k == 8:
        yin()
        xiang_bian.append("0")
    elif k == 7:
        yang()
        xiang_bian.append("1")
    elif k == 6:
        yang()
        xiang_bian.append("1")
    else:
        yin()
        xiang_bian.append("0")
str = ""
xiang_bian = str.join(reversed(xiang_bian))
order = yijing[xiang_bian]
func = "yi_" + order + "()"
eval(func)
